---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroModule.Environment
source: html/11c35a69-a991-57b9-6a2b-7a91f0b38578.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.Environment Property

The Macro environment.

## Syntax (C#)
```csharp
public MacroEnvironment Environment { get; }
```